
&НаКлиенте
Процедура РежимЗапускаНастройкиВО3()
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "НастройкиСтраницы.СтраницаСоединение").Видимость   = Ложь;
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "НастройкиСтраницы.НастройкиДокументов").Видимость  = Ложь;
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "НастройкиСтраницы.ОбщиеНастройки").Видимость  	   = Ложь;  
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "НастройкиСтраницы.ЗаказыПокупателей").Видимость    = Ложь;
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "НастройкиСтраницы.Сервис").Видимость  			   = Ложь;
	УстановитьВидимостьНастроекВО3(Истина);
	
	КлючиИспользовать = КлючиИспользовать + ", advanced_log, download_attachments_on_complete, download_attachments_on_update, 
	|exchange_method, run_docflow, send_invitations, send_type, web_interface";
	
	ЗаполнитьСпискиВыбораРеквизитов();
	ЗаполнитьРеквизитыИзПубличныхНастроек();
	ЗаполнитьРеквизитыИзНастроекПодключения();
	УстановитьДоступностьПоляТипОтправкиПриглашения();	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьНастроекВО3(Видимость)
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "НастройкиСтраницы.ВО3").Видимость = Видимость;
КонецПроцедуры

#Область include_core_base_Настройки_Form_Настройки_ПриИзменении
#КонецОбласти

#Область include_core_base_Настройки_Form_Настройки_ОткрытьВебСтраницы
#КонецОбласти

#Область include_core_base_Настройки_ПрочитатьНастройки
#КонецОбласти

#Область include_core_base_Настройки_Form_Настройки_ЗаполнитьРеквизитыПриОткрытии
#КонецОбласти

#Область include_core_base_Настройки_Form_Настройки_СброситьКэш
#КонецОбласти

#Область include_core_base_Настройки_Form_Настройки_ОсобенностиПриложения
#КонецОбласти

#Область include_core_base_Helpers_FormGetters
#КонецОбласти
