
&НаКлиенте
Функция сбисПолучитьФорму(СбисИмяФормы, Объект1С = Неопределено, ПараметрыФормы = Неопределено, СбисВладелецФормы = Неопределено)
	Возврат ВладелецФормы.сбисПолучитьФорму(СбисИмяФормы, Объект1С, ПараметрыФормы, СбисВладелецФормы);
КонецФункции

// << alo СтатусГос Устанавливаем видимость колонок таблицы
&НаКлиенте
Функция НастроитьКолонки(Ини, Кэш) Экспорт
	ИмяЭлементаТаблица = "Таблица_РеестрДокументов";
	ЭлементТаблица = Кэш.ГлавноеОкно.Элементы[ИмяЭлементаТаблица];
	Если Кэш.ТекущийСеанс.Интерфейс.Свойство("РеестрДокументовКолонки") Тогда // привести в исходное состояние
		Для Каждого Колонка из ЭлементТаблица.ПодчиненныеЭлементы Цикл
			Колонка.видимость = ? (Кэш.ТекущийСеанс.Интерфейс.РеестрДокументовКолонки.Найти(Колонка.Имя) = неопределено, Ложь, Истина);
		КонецЦикла;
	Иначе	// сохранить исходное состояние
		Кэш.ТекущийСеанс.Интерфейс.Вставить("РеестрДокументовКолонки", Новый Массив);
		Для Каждого Колонка из ЭлементТаблица.ПодчиненныеЭлементы Цикл
			Если Колонка.видимость Тогда
				Кэш.ТекущийСеанс.Интерфейс.РеестрДокументовКолонки.Добавить(Колонка.Имя);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;  	
		
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.Расхождение").Видимость = Ложь;   
	МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Кэш.ГлавноеОкно, "Таблица_РеестрДокументов.СтатусВГосСистеме").Видимость = Кэш.Парам.СтатусыВГосСистеме;
	
	ВидимыеКолонки = РассчитатьЗначение("Реестр1С_ВидимыеСтолбцы",Ини, Кэш);
	Если ЗначениеЗаполнено(ВидимыеКолонки) Тогда
		Колонки = Новый Массив;	
		Строка = СтрЗаменить(ВидимыеКолонки, ",", Символы.ПС);
		КолЭлементов = СтрЧислоСтрок(Строка);
		Для сч = 1 по КолЭлементов Цикл
			Колонки.Добавить(Новый Структура("Имя,Ини,Элемент",СокрЛП(СтрПолучитьСтроку(Строка,сч)),Новый Структура,Неопределено));
		КонецЦикла;
		
		Кэш.ГлавноеОкно.НастроитьКолонкиНаСервере(ИмяЭлементаТаблица, Колонки, Ини);	
	КонецЕсли;   

КонецФункции	// alo СтатусГос >>

&НаКлиенте
Процедура ОбновитьПанельНавигации(Кэш) Экспорт
	// функция обновляет панель навигации при переходе по страницам в разделах Полученные и Отправленные	
	ГлавноеОкно = Кэш.ГлавноеОкно;
	Кнопки = сбисПолучитьПодчиненныеЭлементы(сбисЭлементФормы(ГлавноеОкно, "КоманднаяПанельНавигация"),"Кнопки");
	ТекущаяСтраница = ГлавноеОкно.ФильтрСтраница;
	ЕстьЕще = ГлавноеОкно.ФильтрЕстьЕще;
	сбисУстановитьСвойствоЭлементаФормы(Кнопки.НавигацияТекущаяСтраница, ТекущаяСтраница);
	Если ТекущаяСтраница = 1 Тогда
		Кнопки.НавигацияПерваяСтраница.Доступность = Ложь;
		Кнопки.НавигацияПредыдущаяСтраница.Доступность = Ложь;
	КонецЕсли;
	Если ТекущаяСтраница > 1 Тогда
		Кнопки.НавигацияПерваяСтраница.Доступность = Истина;
		Кнопки.НавигацияПредыдущаяСтраница.Доступность = Истина;
	КонецЕсли;
	
	// списочные методы с онлайна не возвращают последнюю страницу
	Если Кэш.Текущий.Раздел = "1"
			Или Кэш.Текущий.Раздел = "2"
			Или Кэш.Текущий.Раздел = "7"
			Или Кэш.Текущий.Раздел = "8"
			Или Кэш.Текущий.Имя = "АккордеонНоменклатураКонтрагентов66" Тогда
		Кнопки.НавигацияПоследняяСтраница.Видимость = Ложь;
	Иначе
		Кнопки.НавигацияПоследняяСтраница.Видимость = Истина;
	КонецЕсли;
	
	Если ЕстьЕще Тогда
		Кнопки.НавигацияПоследняяСтраница.Доступность = Истина;
		Кнопки.НавигацияСледующаяСтраница.Доступность = Истина;
	Иначе
		Кнопки.НавигацияПоследняяСтраница.Доступность = Ложь;
		Кнопки.НавигацияСледующаяСтраница.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
функция ВосстановлениеСостояниеЭД(Контекст) экспорт
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("ИмяПодсистемы",	"БиблиотекаЭлектронныхДокументов");
	ПараметрыПоиска.Вставить("ИмяФункции",		"ВосстановлениеСостояниеЭД");
	фрм = сбисНайтиФормуФункцииПодсистемы(Контекст.Кэш, ПараметрыПоиска);
	Если Не фрм=ложь Тогда
		фрм.ВосстановлениеСостояниеЭД();
	КонецЕсли;
Конецфункции

