
Функция СведенияОВнешнейОбработке() Экспорт

#Область include_sys_version
#КонецОбласти
	
	РегистрационныеДанные = Новый Структура;
	РегистрационныеДанные.Вставить("Наименование", 		"Отправить документ через online.sbis.ru");
	РегистрационныеДанные.Вставить("БезопасныйРежим",	Ложь);
	РегистрационныеДанные.Вставить("Версия",			СбисВерсия);
	РегистрационныеДанные.Вставить("Вид",				"ДополнительнаяОбработка");
	РегистрационныеДанные.Вставить("Информация",		"Обмен документами в электронном виде");
	///////////// команды /////////////////////////
	
	тзКоманд = Новый ТаблицаЗначений;
	тзКоманд.Колонки.Добавить("Идентификатор");
	тзКоманд.Колонки.Добавить("Представление");
	тзКоманд.Колонки.Добавить("Модификатор");
	тзКоманд.Колонки.Добавить("ПоказыватьОповещение");
	тзКоманд.Колонки.Добавить("Использование");
	
	строкаКоманды = тзКоманд.Добавить();
	строкаКоманды.Идентификатор = "1";
	строкаКоманды.Представление = "Обмен электронными документами СБИС";
	строкаКоманды.ПоказыватьОповещение = Истина;
	//строкаКоманды.Использование = "ВызовКлиентскогоМетода"; 
	строкаКоманды.Использование = "ОткрытиеФормы";
	РегистрационныеДанные.Вставить("Команды", тзКоманд);
	
	Возврат РегистрационныеДанные;
КонецФункции

#Область include_local_МодульОбъекта_МодульОбъектаСервер_JSON
#КонецОбласти

