
// Формирование элементов формы
//
// Параметры:
//  ПараметрыФормирования - Структура - Описание элементов формы:
//    - Элементы (структура):
//      - Имя (Ключ структуры)
//      - Заголовок (Строка)
//      - Тип (ОписаниеТипа)
//      - ПодчиненныеЭлементы (Структура) ??????????
//    - Команды (Структура):
//      - Имя (Ключ структуры)
//      - Заголовок (Строка)
//      - Обработчик (СбисОписаниеОповещания)
//
&НаСервере
Процедура СформироватьКонтекстФормы(ПараметрыФормирования)

	РеквизитыФормыУдалить = Новый Массив;
	Для каждого РеквизитФормы Из ПолучитьРеквизиты() Цикл
	
		Если НЕ РеквизитыФормыИгнорировать().НайтиПоЗначению(РеквизитФормы.Имя) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		РеквизитыФормыУдалить.Добавить(РеквизитФормы);
	
	КонецЦикла;
	
	ЭлементыФормыУдалить = Новый Массив;
	Для каждого ЭлементФормы Из Элементы Цикл
	
		Если НЕ ЭлементыФормыИгнорировать().НайтиПоЗначению(ЭлементФормы.Имя) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементыФормыУдалить.Добавить(ЭлементФормы);
		
	КонецЦикла;
	
	КомандыФормыУдалить = Новый Массив;
	Для каждого КомандаФормы Из Команды Цикл
	
		Если НЕ КомандыФормыИгнорировать().НайтиПоЗначению(КомандаФормы.Имя) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		КомандыФормыУдалить.Добавить(КомандаФормы);

	КонецЦикла;
	
	РеквизитыФормыДобавить = Новый Массив;
	ПодготовитьРеквизитыФормы(РеквизитыФормыДобавить, ПараметрыФормирования);
	
	Для каждого ЭлементУдалить Из ЭлементыФормыУдалить Цикл
		Попытка
			Элементы.Удалить(ЭлементУдалить);
		Исключение
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	
	Для каждого КомандаУдалить Из КомандыФормыУдалить Цикл
		Попытка
			Команды.Удалить(КомандаУдалить);
		Исключение
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	
	ИзменитьРеквизиты(РеквизитыФормыДобавить, РеквизитыФормыУдалить);
	
	ПодготовитьКомандыФормы(ПараметрыФормирования);
	
	ПодготовитьЭлементыФормы(ПараметрыФормирования);

	ЗавершитьФормированияФормы(ПараметрыФормирования);
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьРеквизитыФормы(РеквизитыФормыДобавить, ПараметрыФормирования)
	Перем ОписаниеЭлементы;

	Если НЕ ПараметрыФормирования.Свойство("Элементы", ОписаниеЭлементы) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ЭлементОписание Из ОписаниеЭлементы Цикл
	
		ДобавляемыйРеквизит = Новый РеквизитФормы(ЭлементОписание.Ключ,
			ЭлементОписание.Значение.Тип,
			,
			ЭлементОписание.Значение.Заголовок);
			
		РеквизитыФормыДобавить.Добавить(ДобавляемыйРеквизит);
	
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПодготовитьКомандыФормы(ПараметрыФормирования)
	Перем ОписаниеКоманды;

	Если НЕ ПараметрыФормирования.Свойство("Команды", ОписаниеКоманды) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого КомандаОписание Из ОписаниеКоманды Цикл
	
		ДобавляемаяКоманда = Команды.Добавить(КомандаОписание.Ключ);
		ДобавляемаяКоманда.Заголовок = КомандаОписание.Значение.Заголовок;
		ДобавляемаяКоманда.Действие = "Отправить";
	
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПодготовитьЭлементыФормы(ПараметрыФормирования)
	
	Для каждого ЭлементОписание Из ПараметрыФормирования.Элементы Цикл
		
		ДобавляемыйЭлемент = Элементы.Добавить(ЭлементОписание.Ключ, Тип("ПолеФормы"));
		ДобавляемыйЭлемент.ПутьКДанным = ЭлементОписание.Ключ;
		ДобавляемыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		ДобавляемыйЭлемент.Заголовок = ЭлементОписание.Значение.Заголовок;
		
		ДополнитьЭлементСвойствами(ДобавляемыйЭлемент, ЭлементОписание.Значение);
		
	КонецЦикла;
	
	Для каждого КомандаОписание Из ПараметрыФормирования.Команды Цикл
		
		ДобавляемыйЭлемент = Элементы.Добавить(КомандаОписание.Ключ, Тип("КнопкаФормы"), Элементы.ФормаКоманднаяПанель);
		ДобавляемыйЭлемент.ИмяКоманды = КомандаОписание.Ключ;
		ДобавляемыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		ДобавляемыйЭлемент.Заголовок = КомандаОписание.Значение.Заголовок;
		ДобавляемыйЭлемент.ЦветТекста = Новый Цвет(255, 255, 255);
		ДобавляемыйЭлемент.ЦветФона = Новый Цвет(255, 112, 51);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьЭлементСвойствами(Элемент, ОписаниеЭлемента)
	Перем СвойстваЭлемента;
	
	Если НЕ ОписаниеЭлемента.Свойство("Свойства", СвойстваЭлемента) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ОписаниеСвойства Из СвойстваЭлемента Цикл
		Если ОписаниеСвойства.Ключ = "СписокВыбора" Тогда
		
			Для каждого ЭлементСписка Из ОписаниеСвойства.Значение Цикл
				Элемент[ОписаниеСвойства.Ключ].Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
			КонецЦикла;
		
		Иначе
			Элемент[ОписаниеСвойства.Ключ] = ОписаниеСвойства.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьФормированияФормы(ПараметрыФормирования)
	Перем НовыеЭлементы;
	
	Если НЕ ПараметрыФормирования.Свойство("Элементы", НовыеЭлементы) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ОписаниеЭлемента Из НовыеЭлементы Цикл
		
		Если ОписаниеЭлемента.Значение.Свойство("ТипЗначения") Тогда
			ЭтаФорма[ОписаниеЭлемента.Ключ].ТипЗначения = ОписаниеЭлемента.Значение.ТипЗначения;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция РеквизитыФормыИгнорировать()
	
	СписокРеквизитов = Новый СписокЗначений;
	СписокРеквизитов.Добавить("Объект");
	СписокРеквизитов.Добавить("ПараметрыФормы");
	СписокРеквизитов.Добавить("ВозвращаемоеЗначение");
	
	Возврат СписокРеквизитов;
	
КонецФункции

&НаСервере
Функция ЭлементыФормыИгнорировать()
	
	СписокЭлементов = Новый СписокЗначений;
	СписокЭлементов.Добавить("ФормаКоманднаяПанель");
	СписокЭлементов.Добавить("ФормаИзменитьФорму");
	СписокЭлементов.Добавить("ФормаИзменитьФормуРасширеннаяПодсказка");
	СписокЭлементов.Добавить("ФормаСправка");
	СписокЭлементов.Добавить("ФормаСправкаРасширеннаяПодсказка");
	СписокЭлементов.Добавить("ФормаСоздатьНаОсновании");
	СписокЭлементов.Добавить("ФормаСоздатьНаОснованииРасширеннаяПодсказка");
	СписокЭлементов.Добавить("ФормаВзаимодействия");
	СписокЭлементов.Добавить("ФормаВзаимодействияРасширеннаяПодсказка");
	СписокЭлементов.Добавить("ФормаСинхронизацияДанных");
	СписокЭлементов.Добавить("ФормаСинхронизацияДанныхРасширеннаяПодсказка");
	СписокЭлементов.Добавить("ФормаОрганайзер");
	СписокЭлементов.Добавить("ФормаОрганайзерРасширеннаяПодсказка");
	СписокЭлементов.Добавить("ФормаПараметрыСинхронизацииДанных");
	СписокЭлементов.Добавить("ФормаПараметрыСинхронизацииДанныхРасширеннаяПодсказка");
	СписокЭлементов.Добавить("ФормаПечать");
	СписокЭлементов.Добавить("ФормаПечатьРасширеннаяПодсказка");
	
	Возврат СписокЭлементов;
	
КонецФункции

&НаСервере
Функция КомандыФормыИгнорировать()
	
	СписокКоманд = Новый СписокЗначений;
	
	Возврат СписокКоманд;
	
КонецФункции

