
&НаСервере
Процедура СформироватьТаблица(ГруппировкаКолонок, Префикс = "", ПоложениеКолонкиИмя = Неопределено)
	Если Не ЗначениеЗаполнено(ГруппировкаКолонок) Тогда
		Возврат;
	КонецЕсли;
	Для Каждого СтруктураКолонки Из ГруппировкаКолонок Цикл
		Если Не ТипЗнч(СтруктураКолонки.Значение) = Тип("Структура") Тогда
			// Добавление реквизита
			ДобавляемыеРеквизиты = Новый Массив;
			НовРеквизит = Новый РеквизитФормы(Префикс + СтруктураКолонки.Ключ, Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки()), "ТаблДок", СтруктураКолонки.Ключ);
			ДобавляемыеРеквизиты.Добавить(НовРеквизит);
			ИзменитьРеквизиты(ДобавляемыеРеквизиты);
			
			// Добавление элемента
			НовПоле = Элементы.Добавить("ТаблДок" + Префикс + СтруктураКолонки.Ключ, Тип("ПолеФормы"), Элементы.Найти(ПоложениеКолонкиИмя));
			НовПоле.Заголовок = СтруктураКолонки.Ключ;
			НовПоле.Вид = ВидПоляФормы.ПолеВвода;
			НовПоле.ПутьКДанным = "ТаблДок" + "." + Префикс + СтруктураКолонки.Ключ;
		Иначе 
			НовПоле = Элементы.Добавить("ТаблДок" + СтруктураКолонки.Ключ, Тип("ГруппаФормы"), Элементы.Найти(ПоложениеКолонкиИмя));
			НовПоле.Заголовок = СтруктураКолонки.Ключ;
			НовПоле.Вид = ВидГруппыФормы.ГруппаКолонок;
			НовПоле.ОтображатьВШапке = Истина;
			
			СформироватьТаблица(СтруктураКолонки.Значение, СтруктураКолонки.Ключ, НовПоле.Имя);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПодготовитьТаблДокУправ(СписокКолонок)
	ТаблДок.Очистить();
	УдалитьКолонки = Новый Массив;
	УдалитьЭлементы = Новый Массив;
	Для Каждого Поле Из Элементы.ТаблДок.ПодчиненныеЭлементы Цикл
		УдалитьКолонки.Добавить(Поле.ПутьКДанным);
		УдалитьЭлементы.Добавить(Поле.Имя);
	КонецЦикла;
	Для Каждого УдаляемыйЭлемент Из УдалитьЭлементы Цикл
		Элементы.Удалить(Элементы.Найти(УдаляемыйЭлемент));
	КонецЦикла;
	
	ИзменитьРеквизиты(, УдалитьКолонки);
	
	СформироватьТаблица(СписокКолонок,, "ТаблДок");
КонецПроцедуры

