
&НаСервере
Процедура СформироватьТаблица(ГруппировкаКолонок, Префикс = "", ПоложениеКолонкиИмя = Неопределено)
	
	Если Не ЗначениеЗаполнено(ГруппировкаКолонок) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ИмяКолонки Из ГруппировкаКолонок["_Порядок"] Цикл
		
		СтруктураКолонки = Новый Структура("Ключ, Значение", ИмяКолонки, ГруппировкаКолонок[ИмяКолонки]);
		
		Если Не ТипЗнч(СтруктураКолонки.Значение) = Тип("Соответствие") Тогда
			
			// Добавление реквизита
			ДобавляемыеРеквизиты = Новый Массив;
			НовРеквизит = Новый РеквизитФормы(Префикс + СтруктураКолонки.Ключ, Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки()), "ТаблДок", СтруктураКолонки.Ключ);
			ДобавляемыеРеквизиты.Добавить(НовРеквизит);
			ИзменитьРеквизиты(ДобавляемыеРеквизиты);
			
			// Добавление элемента
			НовПоле = Элементы.Добавить("ТаблДок" + Префикс + СтруктураКолонки.Ключ, Тип("ПолеФормы"), Элементы.Найти(ПоложениеКолонкиИмя));
			НовПоле.Заголовок = Синоним(СтруктураКолонки.Ключ);
			НовПоле.ОтображатьВШапке = Не ЗначениеЗаполнено(Префикс);
			НовПоле.Вид = ВидПоляФормы.ПолеВвода;
			НовПоле.ПутьКДанным = "ТаблДок" + "." + Префикс + СтруктураКолонки.Ключ;
			
		Иначе
			
			НовПоле = Элементы.Добавить("ТаблДок" + СтруктураКолонки.Ключ, Тип("ГруппаФормы"), Элементы.Найти(ПоложениеКолонкиИмя));
			НовПоле.Заголовок = Синоним(СтруктураКолонки.Ключ);
			НовПоле.Вид = ВидГруппыФормы.ГруппаКолонок;
			НовПоле.ОтображатьВШапке = Истина;
			
			СформироватьТаблица(СтруктураКолонки.Значение, СтруктураКолонки.Ключ, НовПоле.Имя);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьИерархически(УдалитьКолонки, УдалитьЭлементы, СписокЭлементов)

	 Для Каждого Поле Из СписокЭлементов Цикл
		
		Если ТипЗнч(Поле) <> Тип("ГруппаФормы") Тогда
			УдалитьКолонки.Добавить(Поле.ПутьКДанным);
		Иначе
			УдалитьИерархически(УдалитьКолонки, УдалитьЭлементы, Поле.ПодчиненныеЭлементы)
		КонецЕсли;
		
		УдалитьЭлементы.Добавить(Поле.Имя);
		
	КонецЦикла;

КонецПроцедуры


&НаСервере
Процедура ПодготовитьТаблДокУправ(СписокКолонок)
	
	ТаблДок.Очистить();
	УдалитьКолонки = Новый Массив;
	УдалитьЭлементы = Новый Массив;
	
	УдалитьИерархически(УдалитьКолонки, УдалитьЭлементы, Элементы.ТаблДок.ПодчиненныеЭлементы);
	
	Для Каждого УдаляемыйЭлемент Из УдалитьЭлементы Цикл
		Элементы.Удалить(Элементы.Найти(УдаляемыйЭлемент));
	КонецЦикла;
	
	ИзменитьРеквизиты(, УдалитьКолонки);
	
	СформироватьТаблица(СписокКолонок,, "ТаблДок");
	
КонецПроцедуры

