
&НаКлиенте
Процедура ТабличнаяЧастьНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СбисСтрокаТабличнаяЧастьНоменклатураНачалоВыбора(Кэш, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьЕдИзмОргНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СбисСтрокаТабличнаяЧастьНоменклатураНачалоВыбора(Кэш, Элемент, СтандартнаяОбработка);
	СбисСтрокаТабличнаяЧастьЕдиницаНачалоВыбора(Кэш, Элемент, СтандартнаяОбработка);	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьКоэффициентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СбисСтрокаТабличнаяЧастьКоэффициентНачалоВыбора(Кэш, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьХарактеристикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СбисСтрокаТабличнаяЧастьХарактеристикаНачалоВыбора(Кэш, Элемент, СтандартнаяОбработка);
КонецПроцедуры

